RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_mipi_dsi.c
#if (defined(FSL_FEATURE_DSI_CSR_OFFSET) && FSL_FEATURE_DSI_CSR_OFFSET)
    MIPI_DSI_CSR_Type *csr    = DSI_GET_CSR(base);
    MIPI_DSI_CSR_PXL2DPI(csr) = (uint32_t)config->dpiColorCoding;
#endif

    dpi->PIXEL_PAYLOAD_SIZE     = config->pixelPayloadSize;
    dpi->INTERFACE_COLOR_CODING = (uint32_t)config->dpiColorCoding;
    dpi->PIXEL_FORMAT           = (uint32_t)config->pixelPacket;
    dpi->VIDEO_MODE             = (uint32_t)config->videoMode;

    if (kDSI_DpiBllpLowPower == config->bllpMode)
    {
        dpi->BLLP_MODE         = 0x1U;
        dpi->USE_NULL_PKT_BLLP = 0x0U;
    }
    else if (kDSI_DpiBllpBlanking == config->bllpMode)
    {
        dpi->BLLP_MODE         = 0x0U;
        dpi->USE_NULL_PKT_BLLP = 0x0U;
    }
    else
    {
        dpi->BLLP_MODE         = 0x0U;
        dpi->USE_NULL_PKT_BLLP = 0x1U;
    }

    if (0U != (config->polarityFlags & (uint32_t)kDSI_DpiVsyncActiveHigh))
    {
        dpi->VSYNC_POLARITY = 0x01U;
    }
    else
    {
        dpi->VSYNC_POLARITY = 0x00U;
    }

    if (0U != (config->polarityFlags & (uint32_t)kDSI_DpiHsyncActiveHigh))
    {
        dpi->HSYNC_POLARITY = 0x01U;
    }
    else
    {
        dpi->HSYNC_POLARITY = 0x00U;
    }

    dpi->HFP                   = config->hfp * coff - DSI_HFP_OVERHEAD_BYTE;
    dpi->HBP                   = config->hbp * coff - DSI_HBP_OVERHEAD_BYTE;
    dpi->HSA                   = config->hsw * coff - DSI_HSA_OVERHEAD_BYTE;
    dpi->PIXEL_FIFO_SEND_LEVEL = config->pixelPayloadSize;

    dpi->VBP = config->vbp;
    dpi->VFP = config->vfp;

    dpi->VACTIVE = config->panelHeight - 1UL;

    /* TODO: Configure VC if it is available. */
}

/*!
 * brief Initializes the D-PHY
 *
 * This function configures the D-PHY timing and setups the D-PHY PLL based on
 * user configuration. The configuration structure could be got by the function
 * ref DSI_GetDphyDefaultConfig.
 *
 * param base MIPI DSI host peripheral base address.
 * param config Pointer to the D-PHY configuration.
 * param refClkFreq_Hz The REFCLK frequency in Hz.
 * return The actual D-PHY PLL output frequency. If could not configure the
 * PLL to the target frequency, the return value is 0.
 */
uint32_t DSI_InitDphy(const MIPI_DSI_Type *base, const dsi_dphy_config_t *config, uint32_t refClkFreq_Hz)
{
    assert(config);

    DSI_HOST_NXP_FDSOI28_DPHY_INTFC_Type *dphy = base->dphy;
    DSI_HOST_Type *host                        = base->host;

#if !((defined(FSL_FEATURE_MIPI_NO_DPHY_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL)))
    uint32_t cn, cm, co, outputPllFreq;

    outputPllFreq = DSI_DphyGetPllDivider(&cn, &cm, &co, refClkFreq_Hz, config->txHsBitClk_Hz);

    /* If could not find dividers for the output PLL frequency. */
    if (0U == outputPllFreq)
    {
        return 0U;
    }

    /* Set the DPHY parameters. */
    dphy->CN = (uint32_t)DSI_EncodeDphyPllCn((uint8_t)cn);
    dphy->CM = (uint32_t)DSI_EncodeDphyPllCm((uint8_t)cm);
    dphy->CO = co;
#endif

    /* Set the timing parameters. */
    dphy->M_PRG_HS_PREPARE  = (uint32_t)config->tHsPrepare_HalfEscClk - DSI_THS_PREPARE_HALF_ESC_CLK_BASE;
    dphy->MC_PRG_HS_PREPARE = (uint32_t)config->tClkPrepare_HalfEscClk - DSI_TCLK_PREPARE_HALF_ESC_CLK_BASE;
    dphy->M_PRG_HS_ZERO     = (uint32_t)config->tHsZero_ByteClk - DSI_THS_ZERO_BYTE_CLK_BASE;
    dphy->MC_PRG_HS_ZERO    = (uint32_t)config->tClkZero_ByteClk - DSI_TCLK_ZERO_BYTE_CLK_BASE;
    dphy->M_PRG_HS_TRAIL    = config->tHsTrail_ByteClk;
    dphy->MC_PRG_HS_TRAIL   = config->tClkTrail_ByteClk;

    host->CFG_T_PRE   = config->tClkPre_ByteClk;
    host->CFG_T_POST  = config->tClkPost_ByteClk;
    host->CFG_TX_GAP  = config->tHsExit_ByteClk;
    host->CFG_TWAKEUP = config->tWakeup_EscClk;

#if defined(MIPI_RTERM_SEL_dphy_rterm_sel_MASK)
    dphy->RTERM_SEL = MIPI_RTERM_SEL_dphy_rterm_sel_MASK;
#endif
#if defined(MIPI_TX_RCAL_dphy_tx_rcal_MASK)
    dphy->TX_RCAL = 1;
#endif
    dphy->RXLPRP = 1;
    dphy->RXCDRP = 1;

    /* Auto power down the inactive lanes. */
    dphy->AUTO_PD_EN = 0x1U;

    dphy->TST = 0x25U;

#if !((defined(FSL_FEATURE_MIPI_NO_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_PLL)))
    /* Power up the PLL. */
    dphy->PD_PLL = 0U;

    /* Wait for the PLL lock. */
    while (0UL == dphy->LOCK)
    {
    }
#endif

    /* Power up the DPHY. */
    dphy->PD_TX = 0U;

#if !((defined(FSL_FEATURE_MIPI_NO_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_PLL)))
    return outputPllFreq;
#else
    return config->txHsBitClk_Hz;
#endif
}

/*!
 * brief Deinitializes the D-PHY
 *
 * Power down the D-PHY PLL and shut down D-PHY.
 *
 * param base MIPI DSI host peripheral base address.
 */
void DSI_DeinitDphy(const MIPI_DSI_Type *base)
{
#if !((defined(FSL_FEATURE_MIPI_NO_DPHY_PLL) && (FSL_FEATURE_MIPI_DSI_HOST_NO_DPHY_PLL)))
    /* Power down the PLL. */
    base->dphy->PD_PLL = 1U;
#endif

    /* Power down the DPHY. */
    base->dphy->PD_TX = 1U;
}

/*!
 * brief Get the default D-PHY configuration.
 *
 * Gets the default D-PHY configuration, the timing parameters are set according
 * to D-PHY specification. User could use the configuration directly, or change
 * some parameters according to the special device.
 *
 * param config Pointer to the D-PHY configuration.
 * param txHsBitClk_Hz High speed bit clock in Hz.
 * param txEscClk_Hz Esc clock in Hz.
 */
void DSI_GetDphyDefaultConfig(dsi_dphy_config_t *config, uint32_t txHsBitClk_Hz, uint32_t txEscClk_Hz)
{
    assert(config);

    /* Initializes the configure structure to zero. */
    (void)memset(config, 0, sizeof(*config));

    uint32_t byteClkFreq_kHz = txHsBitClk_Hz / 8U / 1000U;
    uint32_t txEscClk_kHz    = txEscClk_Hz / 1000U;

    config->txHsBitClk_Hz = txHsBitClk_Hz;

    /* THS-EXIT in byte clock. At least 100ns. */
    config->tHsExit_ByteClk = (uint8_t)(DSI_NS_TO_BYTE_CLK(100U, byteClkFreq_kHz) + 1U);

