RT-Thread/rt-thread/bsp/imxrt/libraries/MIMXRT1170/MIMXRT1176/drivers/fsl_mipi_dsi.c
        /* Reset the state to idle. */
        handle->isBusy = false;
    }
}

/*!
 * @brief Interrupt handler for the DSI.
 *
 * @param base MIPI DSI host peripheral base address.
 * @param handle pointer to dsi_handle_t structure which stores the transfer state.
 */
/*!
 * brief Interrupt handler for the DSI.
 *
 * param base MIPI DSI host peripheral base address.
 * param handle pointer to dsi_handle_t structure which stores the transfer state.
 */
void DSI_TransferHandleIRQ(const MIPI_DSI_Type *base, dsi_handle_t *handle)
{
    assert(handle);

    status_t status;
    uint32_t intFlags1, intFlags2;
    uint32_t timeout;
    base = handle->dsi;

    /* If no transfer in progress, return directly. */
    if (!handle->isBusy)
    {
        return;
    }

    /* Make sure the transfer is completed. */
    timeout = FSL_MIPI_DSI_IDLE_TIMEOUT;
    while (0U != (timeout--))
    {
        if (0U == (base->apb->PKT_STATUS & (uint32_t)kDSI_ApbNotIdle))
        {
            break;
        }
    }

    if (0U == timeout)
    {
        DSI_TransferAbort(base, handle);
        status = kStatus_Timeout;
    }
    else
    {
        /* Disable the interrupts. */
        DSI_DisableInterrupts(base,
                              (uint32_t)kDSI_InterruptGroup1ApbTxDone | DSI_INT_STATUS_TRIGGER_MASK |
                                  DSI_INT_STATUS_ERROR_REPORT_MASK | (uint32_t)kDSI_InterruptGroup1ApbRxHeaderReceived |
                                  (uint32_t)kDSI_InterruptGroup1ApbRxPacketReceived |
                                  (uint32_t)kDSI_InterruptGroup1BtaTo | (uint32_t)kDSI_InterruptGroup1LrxTo |
                                  (uint32_t)kDSI_InterruptGroup1HtxTo,
                              (uint32_t)kDSI_InterruptGroup2EccMultiBit | (uint32_t)kDSI_InterruptGroup2CrcError);

        DSI_GetAndClearInterruptStatus(base, &intFlags1, &intFlags2);

        status         = DSI_HandleResult(base, intFlags1, intFlags2, &handle->xfer);
        handle->isBusy = false;
    }

    if (NULL != handle->callback)
    {
        handle->callback(base, handle, status, handle->userData);
    }
}

#if defined(DSI_HOST)
void MIPI_DriverIRQHandler(void);
void MIPI_DriverIRQHandler(void)
{
    /* The first parameter is not used, use the peripheral address defined in
     * handle.
     */
    s_dsiIsr(NULL, s_dsiHandle[0]);
}
#endif
